Ran Plan for project: `sonar` dir: `repositories/sonar` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.github_repository.github_repository.repo: Refreshing state... [id=sonar]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repository.github_repository.repo has been deleted
- resource "github_repository" "repo" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "bump-pkgbuild"
              - protected = false
            },
          - {
              - name      = "dependabot/go_modules/k8s.io/api-0.23.4"
              - protected = false
            },
          - {
              - name      = "dependabot/go_modules/k8s.io/apimachinery-0.23.4"
              - protected = false
            },
          - {
              - name      = "dependabot/go_modules/k8s.io/client-go-0.23.4"
              - protected = false
            },
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "release-v0.1.x"
              - protected = false
            },
          - {
              - name      = "release-v0.2.x"
              - protected = false
            },
          - {
              - name      = "release-v0.3.x"
              - protected = false
            },
          - {
              - name      = "release-v0.4.x"
              - protected = false
            },
          - {
              - name      = "release-v0.5.x"
              - protected = false
            },
          - {
              - name      = "release-v0.6.x"
              - protected = false
            },
        ] -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Sonar deploys a debugging container to a Kubernetes cluster" -> null
      - etag                   = "W/\"817120f1817319620c7ef5bf6e501558b8da1f1c2b33ee86ff2a6f6cfd35f665\"" -> null
      - full_name              = "glitchcrab/sonar" -> null
      - git_clone_url          = "git://github.com/glitchcrab/sonar.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/glitchcrab/sonar" -> null
      - http_clone_url         = "https://github.com/glitchcrab/sonar.git" -> null
      - id                     = "sonar" -> null
      - is_template            = false -> null
      - name                   = "sonar" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkzODgyNTEwNzI=" -> null
      - private                = false -> null
      - repo_id                = 388251072 -> null
      - ssh_clone_url          = "git@github.com:glitchcrab/sonar.git" -> null
      - svn_url                = "https://github.com/glitchcrab/sonar" -> null
      - topics                 = [
          - "debugging",
          - "kubernetes",
          - "troubleshooting",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Sonar deploys a debugging container to a Kubernetes cluster"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "sonar"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "debugging",
          + "kubernetes",
          + "troubleshooting",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

  # module.github_repository_collaborator.github_repository_collaborator.collaborator will be created
+ resource "github_repository_collaborator" "collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "sonar"
      + username                    = "glitchcrab-bot"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p sonar`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=glitchcrab%252Fgithub-repo-management%252Frepositories%252Fsonar%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p sonar`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
